{
    "total_ratings": "350",
    "reviews": [
        {
            "review_rating": "5.0 ",
            "review_author": "Amazon Customer",
            "review_posted_date": "8 September 2016",
            "review_text": "Overall the product is very nice. Delivered on time. Great packing. I would suggest to buy drill kit with case only. All equipments are genuine and good quality.Im completely satisfied with the price and product quality. It is better than 450 RE kit.",
            "review_header": "Satisfied"
        },
        {
            "review_rating": "3.0 ",
            "review_author": "Amazon Customer",
            "review_posted_date": "22 August 2016",
            "review_text": "Over all product is good but all the tools and metal parts got rusted after 1 use which was not expected with a @Bosh products",
            "review_header": "This thing is a rust Magnet!!!!"
        },
        {
            "review_rating": "4.0 ",
            "review_author": "siddharth",
            "review_posted_date": "11 November 2016",
            "review_text": "this is my 3rd kit and yes the kit is really nice but one need to see if they require such a exhaustive tool... it would help in almost all the domestic fixes, just be careful on the material that  u drill and accordingly use the drill bit",
            "review_header": "good product"
        },
        {
            "review_rating": "2.0 ",
            "review_author": "Bhuvaneswari Balan",
            "review_posted_date": "21 August 2016",
            "review_text": "Very disappointed with Bosch... Within 3 months of buying, most of the drill bits and the plyer have rusted. Very mediocre product.",
            "review_header": "Mediocre product at best"
        },
        {
            "review_rating": "3.0 ",
            "review_author": "Hitesh",
            "review_posted_date": "30 December 2016",
            "review_text": "3 Star Rating is only for  \" Bosch Driller \" , which again is excellent product .0 Star Rating for Accessories , they all seems not to be from Bosch [Not Original Tools]. - I doubt durability for the tools given along with driller .",
            "review_header": "which again is excellent product. 0 Star Rating for Accessories"
        },
        {
            "review_rating": "5.0 ",
            "review_author": "Anupam",
            "review_posted_date": "21 January 2017",
            "review_text": "Afterall it is bosch.No wonder machine drills like a knife in butter..My home is  has pretty solid concrete walls and cannot be penetrated easily by professionals with cheap chinese drills..But me although a first time user of drill was able to drill the wall easily.Just get this kit..Hammer was also awesome in kit and helps a lot..",
            "review_header": "Installed CCTv by myself"
        },
        {
            "review_rating": "4.0 ",
            "review_author": "narasimharao",
            "review_posted_date": "27 May 2016",
            "review_text": "Got for 2790, and the price dropped by a couple of hundred  within days after the delivery which was express.  Very good packing and the seal is intact, though Bosh name is not there  on all other items except the  power Drill, all of them are of very good quality. Already saved at least 500 at the most conservative estimate  and planning to do many other minor repairs etc. A must have for all home owners",
            "review_header": "Got it with seal intact"
        },
        {
            "review_rating": "4.0 ",
            "review_author": "saurabh sahu",
            "review_posted_date": "5 April 2017",
            "review_text": "the drill itself seems to be a quality product.the accessories especially the wrench, the measuring tape, seem to be far less standards and low quality product.the hammer seems strurdy enough with good rubber grip, the multi utility knife also is mediocore.",
            "review_header": "good drill with mediocore accesories"
        },
        {
            "review_rating": "5.0 ",
            "review_author": "Ronald Victor",
            "review_posted_date": "12 January 2017",
            "review_text": "I bought it from the  seller cloudtail,was quite apprehensive when I saw reviews of units with broken seals but as always cloudtail has not disappointed got a brand new box with seal intact. This kit from Bosch will enable you to do most household chores .It works really well on concrete too. It has everything you will ever need for any work at home.",
            "review_header": "Must have for any handy jobs."
        },
        {
            "review_rating": "3.0 ",
            "review_author": "Amazon Customer",
            "review_posted_date": "12 June 2016",
            "review_text": "I was shocked when i recieved the product with worst packing it was packed with only bubble cover and i open it i found that seal is broken and items are so hard to use..may be because of new items but no items are missing",
            "review_header": "Product is good but packing is worst seal broken but no item missing"
        },
        {
            "review_rating": "1.0 ",
            "review_author": "Amazon Customer",
            "review_posted_date": "24 December 2016",
            "review_text": "1) Think of a toolkit that dosent have a screw driver. Detachable  bits or heads are there but do they really expect me to u se a drill machine to unscrew.2) The ranche /pana is so thick that it dosent fit in simple places ,for example could not unscrew wheels of a chair3)No allen/hex keys4) the moulding in the case are bad quality, the bits keep falling of and the package isant even a week old5) below avg i d say",
            "review_header": "Really not worth"
        },
        {
            "review_rating": "4.0 ",
            "review_author": "Ashish",
            "review_posted_date": "24 December 2016",
            "review_text": "",
            "review_header": "Four Stars"
        },
        {
            "review_rating": "5.0 ",
            "review_author": "Amazon Customer",
            "review_posted_date": "24 February 2017",
            "review_text": "I have used it for many times now and can say it with satisfaction that its very handy and useful product for those who love doing the small household job themselves and wishes not to dependent over labour who has no sense of responsibility and skills",
            "review_header": "Hand product for self use"
        },
        {
            "review_rating": "3.0 ",
            "review_author": "sunny kumar",
            "review_posted_date": "24 March 2017",
            "review_text": "First 5 star for delivery.However the product is just satisfactory, lacks in quality as the screwdriver heads get easy wear and tear after a single day of usage.Should have bought a better product.",
            "review_header": "Okay Quality"
        },
        {
            "review_rating": "4.0 ",
            "review_author": "Raju",
            "review_posted_date": "29 January 2016",
            "review_text": "The picture shown here is of 500 RE, but the drill is 10 RE and all other accessories are same, so don't get confused by seeing the picture. It is a great and useful tools kit from Bosch. I got it from Cloudtail and it got delivered very quickly, but the problem is that I got it with a broken seal which was quite unacceptable. But as it seemed to be OK, so I didn't returned the product, so 4 star.",
            "review_header": "It is a great and useful tools kit from Bosch"
        },
        {
            "review_rating": "3.0 ",
            "review_author": "sampath",
            "review_posted_date": "1 November 2016",
            "review_text": "No manual book was given, no proper paking, i was saw in you tube they given in unbox, but i got normal paking without manual,i was bought BOSCH angle grinding machine they given good paking and proper box with manual everything is good that's why i prefer BOSCH",
            "review_header": "i was bought BOSCH angle grinding machine they given good paking and proper box with manual everything is good ..."
        },
        {
            "review_rating": "3.0 ",
            "review_author": "DMS",
            "review_posted_date": "14 November 2016",
            "review_text": "Got delivery in time.But when I open it, Seal is tampered..So,returned it..A week time got waste, awaiting for it..Anyway,now going for 13RE/600GB....should see at least if it will come with seal intact",
            "review_header": "Seal is tampered..So,returned it.."
        },
        {
            "review_rating": "5.0 ",
            "review_author": "Pradeep Deb",
            "review_posted_date": "26 December 2015",
            "review_text": "Received the item a couple of days ago and have been using it quite extensively as I have just shifted house (The reason I bought it in the first place). I have used it both as a drill and as a screwdriver and it has worked flawlessly so far. The torque is sufficient for drilling into concrete as well as for tightening screws into hard wood. The only flaw i can determine is with the box. The screwdriver bits just dont stay in place and keep dropping out leaving me searching for it all over the box.",
            "review_header": "Received the item a couple of days ago and have ..."
        },
        {
            "review_rating": "2.0 ",
            "review_author": "Amazon Customer",
            "review_posted_date": "12 August 2016",
            "review_text": "Rusting on metal peices.Also drill bits are not that strong",
            "review_header": "Two Stars"
        },
        {
            "review_rating": "1.0 ",
            "review_author": "Amazon Customer",
            "review_posted_date": "11 December 2016",
            "review_text": "Please don't buy this item. As I got broken seal and many item missing.",
            "review_header": "Please dont buy this item"
        },
        {
            "review_rating": "4.0 ",
            "review_author": "SADIK SUTAR",
            "review_posted_date": "19 October 2016",
            "review_text": "Product is very good......pls check package and seal's",
            "review_header": "Four Stars"
        },
        {
            "review_rating": "4.0 ",
            "review_author": "Satyajit",
            "review_posted_date": "22 August 2016",
            "review_text": "Recently purchased this product. The delivery experience was not so good. It was delayed with status changed as \"Delivery rescheduled by requester\" whereas I never made any changes in the order. When delivered, the cover of the box with instruction information was torn apart, the box was a broken and tools were all over inside the box (be careful while opening it as some of the tools are sharp).The product is really good and the very fact that its from Bosch eases the fear of using a power tool for a novice like me. All the tools are very helpful once you learn how to ease them properly. The built quality of the tools are good except the cheap quality box.My rating is for Bosch not for delivery. For them its 2 stars.",
            "review_header": "Very nice product, very bad delivery."
        },
        {
            "review_rating": "5.0 ",
            "review_author": "shaleesh",
            "review_posted_date": "11 September 2016",
            "review_text": "Excellent product , the bits and the drill is good for concrete walls. Tried N tested. Works smoothly.",
            "review_header": "Excellent product."
        },
        {
            "review_rating": "5.0 ",
            "review_author": "Avadhesh Malik",
            "review_posted_date": "3 May 2016",
            "review_text": "Performs as expected. Masonry bits supplied with the kit need to be better. Rest no complaints!",
            "review_header": "Masonry bits supplied with the kit need to be better. Rest no complaints"
        },
        {
            "review_rating": "5.0 ",
            "review_author": "PC",
            "review_posted_date": "31 October 2016",
            "review_text": "It conatins all necessary equipments requited for home use. Good product. Product manual lacks certain instructions like which drill head should be used for drilling wood, concrete and metal. Found that by hit and trial.",
            "review_header": "Great toolkit"
        },
        {
            "review_rating": "5.0 ",
            "review_author": "gnanam",
            "review_posted_date": "12 October 2016",
            "review_text": "For domestic purpose this is very useful kit. Cost worthy product.No doubt about performance of drilling machine.Drilling bits are in very good quality. Myself entire home shift work done with this tool kit. I am believing amazon always gives very good product. Very much thanks to Bosch and seller for this product.",
            "review_header": "For domestic purpose this is very useful kit. Cost worthy product"
        },
        {
            "review_rating": "1.0 ",
            "review_author": "Amazon Customer",
            "review_posted_date": "29 January 2017",
            "review_text": "this drilling machine are getting only  rs 2300 in turbhe market and you 3500 means other acessory total amount 1200 means you whole money capture under discount",
            "review_header": "this drilling machine are getting only rs 2300 in turbhe ..."
        },
        {
            "review_rating": "5.0 ",
            "review_author": "Bangalorean",
            "review_posted_date": "30 May 2016",
            "review_text": "Amazing value for money at the price of Rs 2609/-.This is the same product as the GSB 500 Kit and is available on Flipkart for about Rs 3000/-.",
            "review_header": "Amazing value for money and an amazing price of Rs 2609/-"
        },
        {
            "review_rating": "2.0 ",
            "review_author": "Adan Hossain",
            "review_posted_date": "17 September 2016",
            "review_text": "The original seal of the box was already open. So the genuineness of the content remains a mystery. Otherwise a good product.!",
            "review_header": "Seal Tampered"
        },
        {
            "review_rating": "5.0 ",
            "review_author": "Vivian",
            "review_posted_date": "19 January 2017",
            "review_text": "Product is very handy to fix any domestic repair all  by yourself. The Drill is sturdy and each element is of a good quality.",
            "review_header": "Good quality product, go for it!"
        }
    ],
    "name": "Bosch GSB 10 RE Home Tool Kit (100 accessories)",
    "price": "₹ 2999.00",
    "ratings": {
        "1 star": "11",
        "2 star": "7",
        "5 star": "207",
        "4 star": "96",
        "3 star": "29"
    }
}