{
    "reviews": [
        {
            "review_header": "You can't get a better lens at this Price.",
            "review_posted_date": "22 November 2016",
            "review_rating": "5.0 ",
            "review_author": "Santosh Panda",
            "review_text": "If you are reading this review, let me tell you that I'm writing this review after using the product since a month.After using the basic lens (18-55mm) with my camera, I wanted to upgrade it with a zoom lens. It it then my search began. I had a budget of 10,000. And within the range of my budget this is the best I could have bought. A great lens if you are in that phase of learning where you want to experiment with new things and reach higher level of photography.Now if you have checked Amazon, a similar zoom lens is priced at 22k. It might make you confused, if you are someone who is new to the world of photography. Well let me note down some points which will clear all your doubts.1. The lens which is 70-300mm but priced at 22k has Auto Focus (AF) and Vibration Reduction (VR) feature which you won't get with this lens. Everything in this lens is Manual. Nothing is Automatic. While capturing you have to manually adjust the settings and focus at your Subject. If you are a learner and your budget is low then go for this lens but if you are rich enough to spend 22k then go for that.P.S. Clicking Picture in the daylight won't make a huge difference but in low lights even a little bit shake can make your image complete blur. Using a Tripod is a better option.2. There is another lens 55-200mm which is available at 10-12k. That lens has AF and VR. But you have to compromise with the zooming power. If you have used a DSLR you surely know the importance of an extra 100mm. So the choice is entirely yours.3. Like Me, if you are someone who want to learn and a bit low on budget then go for this lens. It is worth your bucks. It will enhance your photography skills. Use a tripod while clicking your images, you can give even a 30k lens a good run for its money.Check out the pics that I have clicked using this lens."
        },
        {
            "review_header": "Good lens doesnot matter if its made in china",
            "review_posted_date": "22 February 2017",
            "review_rating": "5.0 ",
            "review_author": "SJ Chakraborty",
            "review_text": "Good lens doesnot matter  if its made in china.  As long as nikon. Less price but good one. Yet to do some experiments. Arrived a day before and the lens is definitely original."
        },
        {
            "review_header": "One Star",
            "review_posted_date": "9 March 2017",
            "review_rating": "1.0 ",
            "review_author": "Amazon Customer",
            "review_text": "Defective products"
        },
        {
            "review_header": "Five Stars",
            "review_posted_date": "30 March 2017",
            "review_rating": "5.0 ",
            "review_author": "Lalu Joe George",
            "review_text": "Good Product"
        },
        {
            "review_header": "Just ok",
            "review_posted_date": "30 January 2017",
            "review_rating": "4.0 ",
            "review_author": "abi",
            "review_text": "This is an ok product"
        },
        {
            "review_header": "Product replacement",
            "review_posted_date": "7 April 2017",
            "review_rating": "3.0 ",
            "review_author": "Amazon Customer",
            "review_text": "The product which i received is not working well, and i have returned it back to the seller for replacement"
        },
        {
            "review_header": "Five Stars",
            "review_posted_date": "29 September 2015",
            "review_rating": "5.0 ",
            "review_author": "Babai",
            "review_text": "A preferable lens for beginners."
        },
        {
            "review_header": "Five Stars",
            "review_posted_date": "19 October 2015",
            "review_rating": "5.0 ",
            "review_author": "Aurindam Chakraborty",
            "review_text": "awesome lens.... must buy!!!!"
        },
        {
            "review_header": "great to have in your Nikon arsenal kit",
            "review_posted_date": "21 December 2016",
            "review_rating": "4.0 ",
            "review_author": "Vikram Avadhaani",
            "review_text": "a must have for every advanced enthusiast :Dthe sharpness is something that stands out from its other competitors.less or negligible chromatic aberration.overall value for money lens, unless you're demanding extreme finesse in your images.(then you're probably better off buying a 70-200 F2.8)"
        },
        {
            "review_header": "Some distant Images with 70-300 Nikon lense without tripod",
            "review_posted_date": "19 December 2016",
            "review_rating": "5.0 ",
            "review_author": "Rakesh Singh",
            "review_text": "Excellent lense. Great value for money. In my Nikon D5100 camera, Auto focus is not working, but manual focus is working best. I used it even without Tripod with careful hand stability and result can be seen in attached image. Thanks Nikon..."
        },
        {
            "review_header": "Incredible value for money!",
            "review_posted_date": "26 April 2016",
            "review_rating": "5.0 ",
            "review_author": "Curious learner",
            "review_text": "This lens does not have a motor in it and so it will auto focus on camera bodies with a built in motor e.g D7000 series and FX cameras. On D3000/5000 series you have to manually focus. I own this lens and the images from it on D7000 are surprisingly good. You have to keep shutter speeds greater than 1/focal length if you shoot hand held. On a crop sensor camera its focal length is 105-450mm, so you have to keep shutter speeds of 1/125 to 1/500 sec to avoid camera shake. You may use a tripod to eliminate camera shake. This is a Value for money lens! Congratulations to Nikon for this budget lens. A kit lens + 35mm f/1.8G or 50mm f/1.8 along with this lens is sufficient for most shooting situations. Use a tripod for low light situations. Nikon has created a low budget complete set with 3 or 4 lenses for all of us. Buy it and keep shooting. For the money you paid you will be pleasantly surprised by its image quality."
        },
        {
            "review_header": "Good as expected",
            "review_posted_date": "31 October 2016",
            "review_rating": "4.0 ",
            "review_author": "Nanda Kishore",
            "review_text": "Good as expected. it is hard for a beginner to use the manual focus in shooting moving objects , but can be used for steady object'si am using this for my Nikon D5200. In this rate the overall quality is good."
        },
        {
            "review_header": "Good Lens if used properly.",
            "review_posted_date": "6 December 2015",
            "review_rating": "5.0 ",
            "review_author": "Karan Piprani",
            "review_text": "It's a good lens for beginners. Using it for months now and my only complain is the lack of VR. But you get what you pay for so not a big deal. Need a very steady hand and good precision if you want to take sharp images at full zoom, when going full manual."
        },
        {
            "review_header": "70-300mm f/4-5.6G Lens from Nikon is a great solution if you are looking for a versatile telephoto zoom",
            "review_posted_date": "6 December 2016",
            "review_rating": "5.0 ",
            "review_author": "SUMIT BISWAS",
            "review_text": "The AF Zoom-NIKKOR 70-300mm f/4-5.6G Lens from Nikon is a great solution if you are looking for a versatile telephoto zoom for FX- or DX-format DSLRs that's easy to carry and compact enough to keep on your camera as you wander the streets or hillsides. Lightweight, comfortable and easy to use with a wide zoom ring, this lens is effective for portraiture and for magnifying distant subjects. On DX-format cameras, its 35mm focal length equivalence is 105-450mm.Built-in aperture control enables simple auto exposure or manual setting from the camera body. Autofocus is quick and accurate on most Nikon cameras and a ring on the front of the barrel provides precise manual focus control. The minimum focus distance is 4.9' throughout the zoom range. Nikon's Super Integrated Lens Coating improves light transmission and reduces flare and ghosting for sharp, high contrast photos and video.Autofocus is not supported by DSLRs lacking an autofocus motor, such as the D40, D40x, D60, D3000, D3100, D3200, D3300, D5000, D5100, D5200, D5300, and D5500 cameras, and the lens may be used with manual focus only. Be sure to check your camera's lens-compatibilityinformation before selecting a new lens.Compact and lightweight 4.3x zoom lens ideal for candids, portraits, travel and sports photography.D-type design provides precise distance information for flash and ambient light exposure process.Super Integrated Lens Coating improves light transmission, reducing ghosting and flare.Nine-blade rounded diaphragm helps to create pleasing out-of-focus highlights."
        },
        {
            "review_header": "Great value, Good Lens, famous NIKKOR quality!",
            "review_posted_date": "9 November 2016",
            "review_rating": "5.0 ",
            "review_author": "Karthik Kumar",
            "review_text": "Perfectly fitted for Nikon DLSR-  D5500 ModelI figured that I would not spend too much on the lense before I went all out on a high end lense. Well after using this lense for a while I may have purchased a lense that I will stick with.this brings me in even closer to animals, bird nests, etc, Great product!!! , This is an awesome lense.* Good range of focal lengths on one lens*  Not meant to provide super high-quality sharpness and detail but IQ is surprisingly good for such an inexpensive lens*  light weight! This and point #1 above are what interested me in this lens as one to take on trips.*  AF seems reliable, sharp under daylight conditions. Not meant to be a high achiever under low-light conditions.I didn't have super high expectations from this lens, but I will say that it performs better than hoped/expected. Given this and the relatively small investment of cash, I would say BUY IT!* shooting sports in daylight settings. does not have the wide ap to blur background but if careful when shooting can clean it up while shooting.does not support auto focus, I found it extremely easy to focus. I recommend a tripod when zooming in at 300. If you don't have one yet rest your arm on something stationary to minimize shaking. Overall a great buy."
        },
        {
            "review_header": "Good at this rate",
            "review_posted_date": "1 October 2015",
            "review_rating": "3.0 ",
            "review_author": "utsav",
            "review_text": "Well you won't get any lens in this range... Though it is manual  but it's got good glass and bad during night time, images become smooth at 300mm and you need a rock hand for going for totally manual.. Overall good lens  ..... Good for bokeh.. Have attached some of the pictures clicked.. But the ring is a bit hard while rolling the lens..."
        },
        {
            "review_header": "BUt getting a 70-300 lens at this price is a great thing in itself",
            "review_posted_date": "21 August 2014",
            "review_rating": "2.0 ",
            "review_author": "ruchir",
            "review_text": "It doesnt have VR, so images at higher zoom wud be blurr. You wud almost always need a tripod to use this lens. WIthout tripod it can be used by keeping shutter speed low but even then u wont get real sharp images.Second drawback is that it doesnt even have inbuilt autofocus, so u have to set the focus manually.BUt getting a 70-300 lens at this price is a great thing in itself. If u think u need a cheap lens and want maximum zoom, and can always use a tripod for this lens, you can buy it !But i would recommend you to go for 55-200 AF-S VR edition"
        },
        {
            "review_header": "Suit Perfectly in D5200 ....  ... Great Bokeh",
            "review_posted_date": "5 November 2016",
            "review_rating": "5.0 ",
            "review_author": "Harikrishnan",
            "review_text": "I have Nikon D5200, as you it doesn't have a built in motor even though using AF 70-300mm lens it gives me wonderful outputs and I love the BOKEH given by this guy. Since it doesn't have VR you need a steady hand to click on full throttle otherwise the output get blurred, at this price this guy is price worthy. Am pretty sure that this guy will give a professional touch to your frames.Happy Shooting Folks!"
        },
        {
            "review_header": "Not satisfactory... felt somewhat a waste of money... :( :( :(",
            "review_posted_date": "27 May 2016",
            "review_rating": "2.0 ",
            "review_author": "Amazon Customer",
            "review_text": "I got his lense just yesterday and am putting my reviews so fast. because, this was my first telephoto lense bought with so much of expectation after reading all those reviews ... so, I tried to click so many photos on many properties/subjects inside and outside the house... inside house with tripod or resting the camera and lense on a wooden table gave satisfactory results, but, not that great. It shakes a lot with handheld and difficult to capture any blur free photos, I am not even impressed even with resting the camera and lens on a wooden table near window side... the image was still blur because of the wind outside the windows... and also the Zoom extension is very smooth and is slippery to hold on hands if not in use... but, overall the build quality is okay for the amount we spend... I have nikon 18-140mm lens with VR bought along with camera. That an amazing lense I have used so far... After using this non VR telephoto lens, I think lenses without Vibration Reduction/ Image stabilization should not be even bought/manufactured... its just waste of money.. thats my opinion..."
        },
        {
            "review_header": "Good Lens, well Worth the Price",
            "review_posted_date": "23 October 2015",
            "review_rating": "5.0 ",
            "review_author": "Dhrubajyoti B.",
            "review_text": "I bought this lens as a cheap 70-300mm lens. I had read about this lens before buying it. It is an Autofocus lens, but it does not have an in-built AF-motor, so it uses the AF-motor in the camera body. So it is better to use this lens with cameras having body motor, like D90, D7000, D750 and the like. I personally own a D7000 and this lens worked like a beauty on my Ladakh trip. It is lightweight, full-frame and has good bokeh. Use it on a tripod in low light and it will work wonders. However in bright light it can be used at ISO100-ISO320, with shutterspeed of 1/100s. It is required to be used with min shutterspeed of 1/100s, if you want good handheld pics. I am attaching some photographs I clicked with this beauty. Please note, the day-time photos have been clicked handheld."
        },
        {
            "review_header": "A must ammunition in your camera bag",
            "review_posted_date": "7 April 2016",
            "review_rating": "5.0 ",
            "review_author": "Vivek Shandilya",
            "review_text": "First thing first, I am no pro , just started an year back and still learning. Views are my personal not to contradict anyone or anything. I already had 18-55,55-200 and 35 prime lens. I took pictures indoors, outdoors, scenic view , portraits etc. Results were also good, but when I checked my friend's pic the sharpness was missing in almost all pics ( barring 35 mm). Incoming Nikon 70-300 mm, which my wife gifted me.The pictures are now crisp sharp. Since the time I have got this I have not removed it from my camera ( d5200) , I have even used it for portraits ( need to shift a little farther) , but I can just assure this lens is simply too good for almost everything. Even in low light ( not dark) this performs pretty well , VR is amazing full zoom to 300 mm still pictures are not blurred. Took few pictures of moon and people thought it is from some pro.If your budget allows it , simply go for it."
        },
        {
            "review_header": "Better than what i expected",
            "review_posted_date": "6 October 2016",
            "review_rating": "4.0 ",
            "review_author": "Abhilash",
            "review_text": "Better than what I Expected. After going through all the reviews and feed backs, i expected a very troubling lease with lot of issues. Actually you need to realize that this is a total manual lens in my Nikon D3200. there is no auto focus, No VR. But you can expect Nikon quality in this product. You will get excellent clicks once you familiar with manual focus in daylight situation. At dim light you may struggle to fix the manual focus. i have attached few snaps which i have taken without a tripod,My Final suggestion is that this is a great product. if you show little patience, you can take great clicks..."
        },
        {
            "review_header": "value for your money",
            "review_posted_date": "15 April 2015",
            "review_rating": "5.0 ",
            "review_author": "sreejithVS",
            "review_text": "Nice product at this cost,non VR can be adjust by using a tripod or choosing appropriate shutter speed.You can use range finder and optical view finder to get good focusing and it comes with a lens hood.Image quality is not the best while comparing with high end lens."
        },
        {
            "review_header": "Value for money, not suitable for low light photography.",
            "review_posted_date": "27 April 2016",
            "review_rating": "3.0 ",
            "review_author": "Anshul JAiswal",
            "review_text": "Pros/Applications:1. Daylight wildlife photography2. Portraits utilizing focal length3.Shooting properly lit distant objectsCons:1. Not at all meant for night photography, it tends to soften images and would hardly lock to subject at greater distance.2. In low light photography too it needs a tripod to focus properly.3. Inserting high noise in ISO more than or equal to 1600."
        },
        {
            "review_header": "Wonderful budget lens with HB-26 Lens Hood for cameras with in-built motor for focusing",
            "review_posted_date": "30 January 2015",
            "review_rating": "5.0 ",
            "review_author": "RUDRANIL GHOSH",
            "review_text": "Wonderful lens. After all it is a Nikon lens. Wonderful clarity. Done some bird photography with this lens. Cropped the birds' photos a lot. Still it presented wonderful pictures without pixelation. No blurring at the extreme telephoto length ie 300 mm. No need for tripod. Think it's better than Tamron 70-300 sans the macro. I also own a Nikon 55-200 AF-S VR IF ED. The 70-300 really extended my reach upto 300 mm without burning a hole in my pocket.And do not forget that the sales package also contains HB-26 lens hood. The package content listed in the site does not mention it. Even the Amazon customer service told me that the sales package does not contain HB-26 lens hood. I was wonderfully surprised to find the lens hood attached to the lens in inverted position inside the box.Lastly a good budget lens from Nikon for cameras with in-built motor for focusing (like my Nikon D7000), since this lens does not have a focusing motor inside."
        },
        {
            "review_header": "Good one for the price we pay",
            "review_posted_date": "30 April 2015",
            "review_rating": "5.0 ",
            "review_author": "Joseph Stalin",
            "review_text": "Good one for the price we pay. Before going through negative reviews have the product's price in Mind!Can't expect anything better for this price tag!"
        },
        {
            "review_header": "Not compatible with D5000 and D3000 series. Beaware. Bought this",
            "review_posted_date": "9 December 2016",
            "review_rating": "3.0 ",
            "review_author": "Vasanth",
            "review_text": "I bought this along with D3300 which I returned back and bought D5200. I did not open the pack for long, later on when I got D5200 after 1 month, I tried this lens on d5200, but autofocus was not working. When googled around, I found that Nikon AF lenses are not compatible with D3000 and D5000 series cameras. I did a mistake by delaying the testing of lens, otherwise could have exchanged in Amazon.Buy AF-S lenses only for D5000 and D3000 cameras. Original nikon is too expensive at around almost same price as camera. Tamron / Sigma are good options."
        },
        {
            "review_header": "Nice Lens, affordable price",
            "review_posted_date": "17 August 2015",
            "review_rating": "5.0 ",
            "review_author": "Harshal Vakil",
            "review_text": "Nice Lens, easy to use with the Nikon at very affordable price. + fast delivery from Amazon..Must buy for the Nikon DSLR owners and beginner or new to photography.Regards,Harshal"
        },
        {
            "review_header": "Masterpiece for beginner wildlife photographers",
            "review_posted_date": "21 August 2016",
            "review_rating": "5.0 ",
            "review_author": "atul",
            "review_text": "I was confused between 55-300 and 70-300VR .Initially purchased 55-300 but one day I used 70-300 borrowed from friend and I was stunned by its AF performance and sharpness.(on nikon d7200)Without any second thought I exchanged my 55-300 with 70-300 and now I am very happy.With my new D500 this work like a fast machine gun"
        },
        {
            "review_header": "Lens to test your mettle, especially for new enthusiasts. Must buy for learning",
            "review_posted_date": "11 September 2016",
            "review_rating": "4.0 ",
            "review_author": "gauri shankar singh",
            "review_text": "Good lens for beginners. This will really test your vigor and help you decide if you are actually willing to spend more on lenses. Getting photo is difficult but not impossible. It will make you work for a good picture which is so needed for photographer newbees. I myself am a newbee and bought just to try out what can I make of it. Posting a few pics from the lens so that you can know what can be done with this lens.Also you have spent only so much, you can easily move to new lens with autofocus and what not. This lens makes you realize slowly what all those features mean and required for.Hope this helps to decide"
        }
    ],
    "ratings": {
        "4 star": "85",
        "1 star": "30",
        "5 star": "133",
        "3 star": "21",
        "2 star": "14"
    },
    "price": "Nikon AF 70-300mm f/4-5.6G Telephoto Zoom Lens for Nikon DSLR Camera",
    "total_ratings": "283",
    "name": "Nikon AF 70-300mm f/4-5.6G Telephoto Zoom Lens for Nikon DSLR Camera"
}