{
    "total_ratings": "283",
    "price": "Nikon AF 70-300mm f/4-5.6G Telephoto Zoom Lens for Nikon DSLR Camera",
    "ratings": {
        "2 star": "14",
        "4 star": "85",
        "3 star": "21",
        "1 star": "30",
        "5 star": "133"
    },
    "reviews": [
        {
            "review_text": "If you are reading this review, let me tell you that I'm writing this review after using the product since a month.After using the basic lens (18-55mm) with my camera, I wanted to upgrade it with a zoom lens. It it then my search began. I had a budget of 10,000. And within the range of my budget this is the best I could have bought. A great lens if you are in that phase of learning where you want to experiment with new things and reach higher level of photography.Now if you have checked Amazon, a similar zoom lens is priced at 22k. It might make you confused, if you are someone who is new to the world of photography. Well let me note down some points which will clear all your doubts.1. The lens which is 70-300mm but priced at 22k has Auto Focus (AF) and Vibration Reduction (VR) feature which you won't get with this lens. Everything in this lens is Manual. Nothing is Automatic. While capturing you have to manually adjust the settings and focus at your Subject. If you are a learner and your budget is low then go for this lens but if you are rich enough to spend 22k then go for that.P.S. Clicking Picture in the daylight won't make a huge difference but in low lights even a little bit shake can make your image complete blur. Using a Tripod is a better option.2. There is another lens 55-200mm which is available at 10-12k. That lens has AF and VR. But you have to compromise with the zooming power. If you have used a DSLR you surely know the importance of an extra 100mm. So the choice is entirely yours.3. Like Me, if you are someone who want to learn and a bit low on budget then go for this lens. It is worth your bucks. It will enhance your photography skills. Use a tripod while clicking your images, you can give even a 30k lens a good run for its money.Check out the pics that I have clicked using this lens.",
            "review_author": "Santosh Panda",
            "review_posted_date": "22 November 2016",
            "review_rating": "5.0 ",
            "review_header": "You can't get a better lens at this Price."
        },
        {
            "review_text": "Good lens doesnot matter  if its made in china.  As long as nikon. Less price but good one. Yet to do some experiments. Arrived a day before and the lens is definitely original.",
            "review_author": "SJ Chakraborty",
            "review_posted_date": "22 February 2017",
            "review_rating": "5.0 ",
            "review_header": "Good lens doesnot matter if its made in china"
        },
        {
            "review_text": "Defective products",
            "review_author": "Amazon Customer",
            "review_posted_date": "9 March 2017",
            "review_rating": "1.0 ",
            "review_header": "One Star"
        },
        {
            "review_text": "Good Product",
            "review_author": "Lalu Joe George",
            "review_posted_date": "30 March 2017",
            "review_rating": "5.0 ",
            "review_header": "Five Stars"
        },
        {
            "review_text": "This is an ok product",
            "review_author": "abi",
            "review_posted_date": "30 January 2017",
            "review_rating": "4.0 ",
            "review_header": "Just ok"
        },
        {
            "review_text": "The product which i received is not working well, and i have returned it back to the seller for replacement",
            "review_author": "Amazon Customer",
            "review_posted_date": "7 April 2017",
            "review_rating": "3.0 ",
            "review_header": "Product replacement"
        },
        {
            "review_text": "A preferable lens for beginners.",
            "review_author": "Babai",
            "review_posted_date": "29 September 2015",
            "review_rating": "5.0 ",
            "review_header": "Five Stars"
        },
        {
            "review_text": "awesome lens.... must buy!!!!",
            "review_author": "Aurindam Chakraborty",
            "review_posted_date": "19 October 2015",
            "review_rating": "5.0 ",
            "review_header": "Five Stars"
        },
        {
            "review_text": "a must have for every advanced enthusiast :Dthe sharpness is something that stands out from its other competitors.less or negligible chromatic aberration.overall value for money lens, unless you're demanding extreme finesse in your images.(then you're probably better off buying a 70-200 F2.8)",
            "review_author": "Vikram Avadhaani",
            "review_posted_date": "21 December 2016",
            "review_rating": "4.0 ",
            "review_header": "great to have in your Nikon arsenal kit"
        },
        {
            "review_text": "Excellent lense. Great value for money. In my Nikon D5100 camera, Auto focus is not working, but manual focus is working best. I used it even without Tripod with careful hand stability and result can be seen in attached image. Thanks Nikon...",
            "review_author": "Rakesh Singh",
            "review_posted_date": "19 December 2016",
            "review_rating": "5.0 ",
            "review_header": "Some distant Images with 70-300 Nikon lense without tripod"
        },
        {
            "review_text": "Looking to go telephoto? Well you are at the right page in that case, I will be giving you the reasons for that. First of all a clear confession that I personally don't own this lens but I have used it to shoot several times. My brother own it and so I got a lot of chance to shoot with it. This is a complete manual lens with no VR. Well based on my experience with this lens I would like to clarify all the basic features as well as whom this lens really is for. Sounds good? Then lets begin. Lets move to the features, then pros, cons and subsequently verdict.⦿⦿⦿⦿⦿⦿⦿⦿⦿⦿BASIC FEATURES:⦿⦿⦿⦿⦿⦿⦿⦿⦿⦿⦿ Nikon F-Mount.⦿ Focal Range of 70-300 mm (4.3x).⦿ Maximum Aperture f/4.0 at 70 mm and then narrows down with increase focal length to f/5.6 at 300 mm and the minimum aperture is f/32.⦿ Minimum focus distance 1.5 m or 4.9 ft.⦿ FX format lens.⦿ Filter thread 62 mm⦿ Only Manual focus.(NOTE: No auto focus motor built in so to use AF you need to use a camera which has built in AF motor)⦿ Comes with a lens hood.For information in details refer to this link [ [...]]✔✔✔✔✔PROS:✔✔✔✔✔✔ The lens has a long zoom range from 70 mm all the way to 300 mm, which means that you don't have to carry multiple lenses as you get a wide variety of focal length. I personally use it for bokeh and wildlife shots and nature shots.✔ The lens captures fantastic bokeh. This is a super telephoto lens all the way upto 300 mm. Due to high zoom the picture compresses well and blows out the foreground and background of the specific subject. Keep you lens at the maximum aperture an keep the focal length 85 mm or above and you will see some great bokeh which will really make you happy.✔ Now I fell in love with the focus ring. The focus ring is really very smooth for easy operating. It focuses very quietly and accurately. If you love manual focusing you subject then this lens will never let you down.✔ The lens is and FX lens, so you can use it both with FX as well as DX cameras. Since DX cameras has a 1.5x crop factor therefore the focal length in DX camera would be 105 mm to 450 mm, which is a huge zoom,✔ This lens is made of real good glass for the MRP. The lens can shoot with high mega-pixel sensors without ruining the image quality at pixel peep zoom. I saw very less vignetting on this lens which is really good and the pictures are also sharp.✔ Considering a super telephoto lens this lens is really light at approx. 425 g which is really spectacular. No clue how Nikon kept those13 lens elements under 500 g.✔ Even if it is an FX lens at 7150 bucks but still Nikon has done no compromise with body of the lens. You get that same quality feel for which Nikon is known for, with those pebbles like texture throughout the body. The lens comes with a huge zoom ring coated with rubber for zooming with ease and the focus ring is also rubber coated.✘✘✘✘✘CONS:✘✘✘✘✘✘ The lens lacks VR so you have to have a rock solid hand to capture images without a tripod. This is really tough to use this lens without a tripod and the difficulty worsens with increase in focal length. But with practise the problem should go away a bit.✘ No Internal Focusing. The lens does not have internal focusing so every time you focus on something the lens barrel moves inwards or outwards thus creating problems in balancing at times.✘ The picture is well focused upto 290 mm but at 300 mm the picture becomes soft, I have uploaded a picture of a bird shot at 300 mm, there you can clearly notice that the background is softened.✘ Not recommended for those who want to do night photography, because at night the focusing becomes terribly hard even in manual. I have not tried the auto focus as I don't have a camera with built-in AF motor.⦾⦾⦾⦾⦾⦾⦾⦾⦾⦾⦾⦾⦾⦾⦾⦾⦾⦾⦾FOR WHOM THIS CAMERA REALLY IS:⦾⦾⦾⦾⦾⦾⦾⦾⦾⦾⦾⦾⦾⦾⦾⦾⦾⦾⦾Personally I feel this camera is for the folks who love to shoot wildlife, produce bokehs and for sports(provided your camera has built-in focus motor). If you are an amateur and looking for your first zoom lens then definitely go for this one. Not recommended for Night Photography whatsoever.(NOTE: If you depend more on auto-focusing then better look for Nikon AF-S lenses such as Nikon AF-S 55-200mm and many others.)◘◘◘◘◘◘◘◘VERDICT:◘◘◘◘◘◘◘◘Personally I love shooting with this lens and would literally recommend to almost everyone whether amateur or advanced photographer. This lens can serve either as a great first telephoto lens for you or if you have other telephoto lenses then as a backup lens. The focal range is really good as maximum daily zoom shots fall under this range. For the price you cant beat it. A steal deal for an FX lens that too from Nikon. I have posted some pictures of the images I captured with this lens. Please hit YES if you found my review helpful, else if you have any questions the feel free to comment on this review, I will try my best to help you. Thank You... Happy Shopping...",
            "review_author": "Gourav",
            "review_posted_date": "9 January 2016",
            "review_rating": "4.0 ",
            "review_header": "Outstanding lens with an unbelievable price tag!!! Detailed review..."
        },
        {
            "review_text": "Nice lens for candid shots. The auto focus doesn't work with Nikon D5200",
            "review_author": "Krish",
            "review_posted_date": "2 April 2017",
            "review_rating": "4.0 ",
            "review_header": "Four Stars"
        },
        {
            "review_text": "Awesome, my pics clarity upscaled compared to the default lense provided with my D5200.",
            "review_author": "K M Chaitanya",
            "review_posted_date": "22 January 2017",
            "review_rating": "5.0 ",
            "review_header": "Loved it"
        },
        {
            "review_text": "It's quite good actually...those who like to shoot in manual mode... It's perfect for them at this price",
            "review_author": "Sid",
            "review_posted_date": "26 February 2017",
            "review_rating": "4.0 ",
            "review_header": "Four Stars"
        },
        {
            "review_text": "Want to return not satisfied with the product",
            "review_author": "Sandy",
            "review_posted_date": "22 January 2017",
            "review_rating": "1.0 ",
            "review_header": "One Star"
        },
        {
            "review_text": "gud one lens",
            "review_author": "Amazon Customer",
            "review_posted_date": "15 March 2017",
            "review_rating": "5.0 ",
            "review_header": "Five Stars"
        },
        {
            "review_text": "Go for it... You won't regret 👍",
            "review_author": "Amazon Customer",
            "review_posted_date": "10 March 2017",
            "review_rating": "5.0 ",
            "review_header": "Awesome product"
        },
        {
            "review_text": "Good lens for beginners. This will really test your vigor and help you decide if you are actually willing to spend more on lenses. Getting photo is difficult but not impossible. It will make you work for a good picture which is so needed for photographer newbees. I myself am a newbee and bought just to try out what can I make of it. Posting a few pics from the lens so that you can know what can be done with this lens.Also you have spent only so much, you can easily move to new lens with autofocus and what not. This lens makes you realize slowly what all those features mean and required for.Hope this helps to decide",
            "review_author": "gauri shankar singh",
            "review_posted_date": "11 September 2016",
            "review_rating": "4.0 ",
            "review_header": "Lens to test your mettle, especially for new enthusiasts. Must buy for learning"
        },
        {
            "review_text": "I bought this along with D3300 which I returned back and bought D5200. I did not open the pack for long, later on when I got D5200 after 1 month, I tried this lens on d5200, but autofocus was not working. When googled around, I found that Nikon AF lenses are not compatible with D3000 and D5000 series cameras. I did a mistake by delaying the testing of lens, otherwise could have exchanged in Amazon.Buy AF-S lenses only for D5000 and D3000 cameras. Original nikon is too expensive at around almost same price as camera. Tamron / Sigma are good options.",
            "review_author": "Vasanth",
            "review_posted_date": "9 December 2016",
            "review_rating": "3.0 ",
            "review_header": "Not compatible with D5000 and D3000 series. Beaware. Bought this"
        },
        {
            "review_text": "Awesome product for its cost, but can only be used in day light",
            "review_author": "Approved Customer",
            "review_posted_date": "5 March 2016",
            "review_rating": "4.0 ",
            "review_header": "Four Stars"
        },
        {
            "review_text": "It's a good item.",
            "review_author": "BRAJPAL S.",
            "review_posted_date": "31 December 2016",
            "review_rating": "5.0 ",
            "review_header": "Five Stars"
        },
        {
            "review_text": "To start with, let me mention, it's a deal breaker  It has a good zoom range, but as you'd expect given how much you can spend on a similar telephoto lens, there are some bad points. To start with, the auto focus is very slow and noisy, and what I have found to be the biggest problem, is that you have to stand quite a long way away from your subject (over 1 metre). If you are on a tight budget and need some zoom this is a good solution. The image quality is excellent up to 200mm; after that, images get slightly soft and there is some loss of contrast; however it is not much of a problem. The end of the lens rotates as it focuses, which is a bit annoying if you are using filters. The lens also does not focus very close, which makes the lens less optimal if you want a cheap macro option. If you plan on shooting outside in good light, It does take very good pictures. For a lens of this price, this could be a good choice for a first zoom lens.",
            "review_author": "M3N0N",
            "review_posted_date": "3 January 2017",
            "review_rating": "5.0 ",
            "review_header": "The best budget fully manual telephoto lens so far(No pun intended)"
        },
        {
            "review_text": "HELLOLooking to go telephoto? Well you are at the right page in that case, I will be giving you the reasons for that. First of all a clear confession that I personally don't own this lens but I have used it to shoot several times. My brother own it and so I got a lot of chance to shoot with it. This is a complete manual lens with no VR. Well based on my experience with this lens I would like to clarify all the basic features as well as whom this lens really is for. Sounds good? Then lets begin. Lets move to the features, then pros, cons and subsequently verdict.⦿⦿⦿⦿⦿⦿⦿⦿⦿⦿BASIC FEATURES:⦿⦿⦿⦿⦿⦿⦿⦿⦿⦿⦿ Nikon F-Mount.⦿ Focal Range of 70-300 mm (4.3x).⦿ Maximum Aperture f/4.0 at 70 mm and then narrows down with increase focal length to f/5.6 at 300 mm and the minimum aperture is f/32.⦿ Minimum focus distance 1.5 m or 4.9 ft.⦿ FX format lens.⦿ Filter thread 62 mm⦿ Only Manual focus.(NOTE: No auto focus motor built in so to use AF you need to use a camera which has built in AF motor)⦿ Comes with a lens hood.For information in details refer to this link [ [...]]✔✔✔✔✔PROS:✔✔✔✔✔✔ The lens has a long zoom range from 70 mm all the way to 300 mm, which means that you don't have to carry multiple lenses as you get a wide variety of focal length. I personally use it for bokeh and wildlife shots and nature shots.✔ The lens captures fantastic bokeh. This is a super telephoto lens all the way upto 300 mm. Due to high zoom the picture compresses well and blows out the foreground and background of the specific subject. Keep you lens at the maximum aperture an keep the focal length 85 mm or above and you will see some great bokeh which will really make you happy.✔ Now I fell in love with the focus ring. The focus ring is really very smooth for easy operating. It focuses very quietly and accurately. If you love manual focusing you subject then this lens will never let you down.✔ The lens is and FX lens, so you can use it both with FX as well as DX cameras. Since DX cameras has a 1.5x crop factor therefore the focal length in DX camera would be 105 mm to 450 mm, which is a huge zoom,✔ This lens is made of real good glass for the MRP. The lens can shoot with high mega-pixel sensors without ruining the image quality at pixel peep zoom. I saw very less vignetting on this lens which is really good and the pictures are also sharp.✔ Considering a super telephoto lens this lens is really light at approx. 425 g which is really spectacular. No clue how Nikon kept those13 lens elements under 500 g.✔ Even if it is an FX lens at 7150 bucks but still Nikon has done no compromise with body of the lens. You get that same quality feel for which Nikon is known for, with those pebbles like texture throughout the body. The lens comes with a huge zoom ring coated with rubber for zooming with ease and the focus ring is also rubber coated.✘✘✘✘✘CONS:✘✘✘✘✘✘ The lens lacks VR so you have to have a rock solid hand to capture images without a tripod. This is really tough to use this lens without a tripod and the difficulty worsens with increase in focal length. But with practise the problem should go away a bit.✘ No Internal Focusing. The lens does not have internal focusing so every time you focus on something the lens barrel moves inwards or outwards thus creating problems in balancing at times.✘ The picture is well focused upto 290 mm but at 300 mm the picture becomes soft, I have uploaded a picture of a bird shot at 300 mm, there you can clearly notice that the background is softened.✘ Not recommended for those who want to do night photography, because at night the focusing becomes terribly hard even in manual. I have not tried the auto focus as I don't have a camera with built-in AF motor.⦾⦾⦾⦾⦾⦾⦾⦾⦾⦾⦾⦾⦾⦾⦾⦾⦾⦾⦾FOR WHOM THIS CAMERA REALLY IS:⦾⦾⦾⦾⦾⦾⦾⦾⦾⦾⦾⦾⦾⦾⦾⦾⦾⦾⦾Personally I feel this camera is for the folks who love to shoot wildlife, produce bokehs and for sports(provided your camera has built-in focus motor). If you are an amateur and looking for your first zoom lens then definitely go for this one. Not recommended for Night Photography whatsoever.(NOTE: If you depend more on auto-focusing then better look for Nikon AF-S lenses such as Nikon AF-S 55-200mm and many others.)◘◘◘◘◘◘◘◘VERDICT:◘◘◘◘◘◘◘◘Personally I love shooting with this lens and would literally recommend to almost everyone whether amateur or advanced photographer. This lens can serve either as a great first telephoto lens for you or if you have other telephoto lenses then as a backup lens. The focal range is really good as maximum daily zoom shots fall under this range. For the price you cant beat it. A steal deal for an FX lens that too from Nikon. I have posted some pictures of the images I captured with this lens. Please hit YES if you found my review helpful, else if you have any questions the feel free to comment on this review, I will try my best to help you. Thank You... Happy Shopping...PLEASE HIT YES IF YOU LIKE MY REVIEW",
            "review_author": "Aman Modi",
            "review_posted_date": "5 November 2016",
            "review_rating": "5.0 ",
            "review_header": "MY OPINION"
        },
        {
            "review_text": "Not have auto focus for D3200,3300....D5000,5100,5200,....5500 etc. I am not satisfied because you cannot take snap for flying object, moving objects....as you take some time to fix focus......Aslo you need tripod for still object otherwise photo will not be clear. You should go for VR version...some sample pictures are attached for understanding......",
            "review_author": "Subhasis Das",
            "review_posted_date": "5 November 2015",
            "review_rating": "2.0 ",
            "review_header": "I am not satisfied because you cannot take snap for flying object"
        },
        {
            "review_text": "Well you won't get any lens in this range... Though it is manual  but it's got good glass and bad during night time, images become smooth at 300mm and you need a rock hand for going for totally manual.. Overall good lens  ..... Good for bokeh.. Have attached some of the pictures clicked.. But the ring is a bit hard while rolling the lens...",
            "review_author": "utsav",
            "review_posted_date": "1 October 2015",
            "review_rating": "3.0 ",
            "review_header": "Good at this rate"
        },
        {
            "review_text": "Well though i have given a 4Star, but it's one of the best at this price range. One should purchase it if he okay with the facts that it don't have in-built automatic focusing as well asVR. So you have to tackle manually.The shake reduction n chromatic aberration (yes it is there) can be removed in post production.Good for Day light portrait, stage shows, sports and to some extent, wildlife photography.Here you can get some examples",
            "review_author": "Debashis RC",
            "review_posted_date": "31 January 2016",
            "review_rating": "4.0 ",
            "review_header": "Best at this Price, Woth Buying"
        },
        {
            "review_text": "Is it compatible with nikon D3200. [ [ASIN:B000HJPK2C Nikon 70-300mm f4.5-5.6 G AF-S VR IF-ED Telephoto Zoom Lens for Nikon DSLR Camera]]",
            "review_author": "Amazon Customer",
            "review_posted_date": "29 March 2017",
            "review_rating": "2.0 ",
            "review_header": "Is it compatible with nikon D3200. [ [ASIN: ..."
        },
        {
            "review_text": "It doesn't have any autofocus..They are fooling us...",
            "review_author": "Sarita k.",
            "review_posted_date": "19 January 2017",
            "review_rating": "1.0 ",
            "review_header": "Don't buy...Doesn't have autofocus"
        },
        {
            "review_text": "This lens does not have a motor in it and so it will auto focus on camera bodies with a built in motor e.g D7000 series and FX cameras. On D3000/5000 series you have to manually focus. I own this lens and the images from it on D7000 are surprisingly good. You have to keep shutter speeds greater than 1/focal length if you shoot hand held. On a crop sensor camera its focal length is 105-450mm, so you have to keep shutter speeds of 1/125 to 1/500 sec to avoid camera shake. You may use a tripod to eliminate camera shake. This is a Value for money lens! Congratulations to Nikon for this budget lens. A kit lens + 35mm f/1.8G or 50mm f/1.8 along with this lens is sufficient for most shooting situations. Use a tripod for low light situations. Nikon has created a low budget complete set with 3 or 4 lenses for all of us. Buy it and keep shooting. For the money you paid you will be pleasantly surprised by its image quality.",
            "review_author": "Curious learner",
            "review_posted_date": "26 April 2016",
            "review_rating": "5.0 ",
            "review_header": "Incredible value for money!"
        },
        {
            "review_text": "Is it fit for Nikon d5100???",
            "review_author": "bishal",
            "review_posted_date": "21 March 2017",
            "review_rating": "1.0 ",
            "review_header": "One Star"
        }
    ],
    "name": "Nikon AF 70-300mm f/4-5.6G Telephoto Zoom Lens for Nikon DSLR Camera"
}