[
    {
        "ratings": {
            "5 star": "194",
            "4 star": "97",
            "1 star": "84",
            "3 star": "47",
            "2 star": "31"
        },
        "name": "Tapfond® Oneplus 3 Oneplus 3T All Sides Protection \"360 Degree\" Sleek Quicksand Matte Hard Back Case Cover For Oneplus 3 One Plus 3T - Sandstone Black",
        "price": "",
        "reviews": [
            {
                "review_comment_count": "",
                "review_author": " Chirag",
                "review_text": "Cons : 1) If you have used the OnePlus one, then you know that this isn't the sandstone finish right away. At best, it feels like a fraction of the original sandstone finish. 2) The sandstone finish is not just on the outside, but on the inside too. There is a potential for severe scratch if not applied/removed with the utmost care. 3) It is a nightmare to remove and/or apply this case. Even the button protection has the sandstone finish on the inside which makes me very nervous while pressing the buttons from over the case. 4) Lacks OnePlus logo (as expected), but has a very subtle print which says \"Tapfond\". Pros: 1) Really lightweight and increased grip than what the metal body can offer. 2) Best hard cover in this price segment. 3) Covers phone from all 4 sides and the back while covering the camera hump. Verdict : Better buy the original OnePlus sandstone cover for 800 if possible. It's the best. If you're tight on budget and want a sandtone(ish) case, get this but don't keep removing/applying this case continuously to avoid scratches.",
                "review_header": "Buy it if you are ready to face the problems which come along",
                "review_posted_date": " on 29 December 2016",
                "review_rating": "3.0 "
            },
            {
                "review_comment_count": "",
                "review_author": " Michael",
                "review_text": "Product is OK...cutouts are perfect....believe me the cutouts are perfect but the finish is not sandstone...it looks like but dose'nt feel like sandstone. also very difficult to remove....especially for me as i keep changing my back covers on a regular basis.",
                "review_header": "OK Product....but not worth the money",
                "review_posted_date": " on 24 August 2016",
                "review_rating": "3.0 "
            },
            {
                "review_comment_count": "",
                "review_author": " Shashank Redd",
                "review_text": "I have just one word for this case AWESOME. One plus has switched to aluminum I missed the sand stone back but this case makes up for it but the texture is decent but the case covers the phone in 360° I dropped my quite a few times but the case protected it quite qood. This is excellent product for the price",
                "review_header": "Awesome product definitely try it",
                "review_posted_date": " on 8 November 2016",
                "review_rating": "5.0 "
            },
            {
                "review_comment_count": "",
                "review_author": " Amazon Customer",
                "review_text": "The product would've been nice if it was not worn out from the sides as though some one had used it. It looked fine at first so I threw away the packaging. Later I noticed it was oldish but couldn't return as I didn't have the packaging...",
                "review_header": "Worn out and used looking",
                "review_posted_date": " on 4 January 2017",
                "review_rating": "1.0 "
            },
            {
                "review_comment_count": "",
                "review_author": " feroz khan",
                "review_text": "I have been looking for a while for a cover which covers all the 4 sides and guess what, this is the only cover on Amazon which covers all the 4 sides. Great grip because of the sandstone finish..over all great product. I recommend.",
                "review_header": "Worth a buy.",
                "review_posted_date": " on 24 July 2016",
                "review_rating": "5.0 "
            },
            {
                "review_comment_count": "",
                "review_author": " Customer",
                "review_text": "I am very disappointed with this case. This case makes the OnePlus3 power button to remain pressed as soon as you put it on and makes the phone restart continuously rendering it useless. I have returned it and won't buy a Tapfond product again.",
                "review_header": "Poor fit. Makes OnePlus3 restart continuously!",
                "review_posted_date": " on 22 October 2016",
                "review_rating": "1.0 "
            },
            {
                "review_comment_count": "",
                "review_author": " Aaron Sarwal",
                "review_text": "The cover feel is amazing, a tad expensive at 300/- Gold color is also so so... But the fit and finish and the fact that the volume and power keys are protected. Also I read many reviews about the cons of this cover. I couldn't find any. Don't expect a 1+ quality sandstone finish, still this rough rubbery texture makes sure the phone won't slip. And IT DOES NOT SCRATCH TGR PHONE OR LEAD TO THE SLIVER PAINT COMING OFF. Its fantastic.",
                "review_header": "Perfect fit!",
                "review_posted_date": " on 4 October 2016",
                "review_rating": "4.0 "
            },
            {
                "review_comment_count": "",
                "review_author": " vaibhav malabade",
                "review_text": "Fits perfectly.. all the cutouts are perfect.. sandstone finish both outside and inside (dont worry its doesnt scratch the phone body) Feels great in hands but please dont expect 100℅ protection against accidental drops.",
                "review_header": "pretty decent",
                "review_posted_date": " on 11 January 2017",
                "review_rating": "4.0 "
            }
        ],
        "url": "http://www.amazon.in/dp/B01HBAI9SG"
    }
]